test/orgtbl-major-mode-tests.org
#+auto_tangle: t
* Header
#+begin_src emacs-lisp :tangle yes
;;; orgtbl-major-mode-tests.el --- Time tracking with org-tables -*- lexical-binding: t; -*-

;; Author: Earl Chase
;; Maintainer: Earl Chase
;; Version: 0.0
;; Keywords: time

;; This file is NOT part of GNU Emacs.

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation; either version 3, or (at your option)
;; any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with GNU Emacs; see the file COPYING.  If not, write to the
;; Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor,
;; Boston, MA 02110-1301, USA.

;;; Commentary:

;; Track your time

;;; Code:

#+end_src
* imports
#+begin_src elisp :tangle yes
  (require 'org-table)
  (require 'orgtbl-major-mode)
  (load "~/.config/emacs/lib/generate/generate.el")

#+end_src
* DONE reintegrate generate.el
CLOSED: [2026-01-07 Wed 19:14]
:LOGBOOK:
CLOCK: [2026-01-07 Wed 19:11]--[2026-01-07 Wed 19:14] =>  0:03
CLOCK: [2026-01-06 Tue 20:30]--[2026-01-06 Tue 20:32] =>  0:02
CLOCK: [2026-01-06 Tue 20:13]--[2026-01-06 Tue 20:15] =>  0:02
:END:
* org-table-autofill
** with random string
:LOGBOOK:
CLOCK: [2025-11-22 Sat 16:19]--[2025-11-22 Sat 16:22] =>  0:03
CLOCK: [2025-11-20 Thu 17:47]--[2025-11-20 Thu 18:10] =>  0:23
CLOCK: [2025-11-20 Thu 15:35]--[2025-11-20 Thu 15:39] =>  0:04
:END:
*** right
:PROPERTIES:
:ID:       24c72cc5-a91e-4143-a909-d8344cee0eeb
:END:
:LOGBOOK:
CLOCK: [2025-11-27 Thu 03:00]--[2025-11-27 Thu 03:07] =>  0:07
CLOCK: [2025-11-27 Thu 00:33]--[2025-11-27 Thu 00:35] =>  0:02
CLOCK: [2025-11-26 Wed 19:24]--[2025-11-26 Wed 19:31] =>  0:07
CLOCK: [2025-11-26 Wed 16:54]--[2025-11-26 Wed 17:12] =>  0:18
CLOCK: [2025-11-22 Sat 18:34]--[2025-11-22 Sat 18:56] =>  0:22
CLOCK: [2025-11-22 Sat 16:22]--[2025-11-22 Sat 16:31] =>  0:09
:END:
#+begin_src elisp :tangle yes
  (generate-ert-deftest-n-times org-table-autofill-string-right ()
    (-let* ((test-row-count (generate-random-nat-number-in-range (list 2 10)))
  	  (test-row-number (generate-random-nat-number-in-range (list 1 test-row-count)))
  	  (test-beg-column-number (generate-random-nat-number-in-range (list 1 10)))
  	  (test-end-column-number (generate-random-nat-number-in-range (list (1+ test-beg-column-number) (+ 10 test-beg-column-number))))
  	  (test-column-count (generate-random-nat-number-in-range (list (1+ test-end-column-number) (+ 10 test-end-column-number))))
  	  (test-cell-value (generate-random-word)))
      (should
       (equal (generate-with-buffer-with-org-table-with-hlines (list (cl-constantly test-cell-value) test-row-count test-column-count)  				     
  				   (org-table-goto-line-column test-row-number test-beg-column-number)
  				   (org-table-get-field nil test-cell-value)
  				   (setq test-beg (point))
  				   (org-table-goto-column test-end-column-number)
  				   (setq test-end (point))
  				   (org-table-autofill test-beg test-end)
  				   (org-table-align)
  				   (org-no-properties-and-trim (org-table-get-field (generate-random-nat-number-in-range (list test-beg-column-number test-end-column-number)))))
  	    test-cell-value))))
#+end_src
*** Left
:LOGBOOK:
CLOCK: [2025-11-27 Thu 03:07]--[2025-11-27 Thu 03:09] =>  0:02
CLOCK: [2025-11-27 Thu 02:58]--[2025-11-27 Thu 02:59] =>  0:01
CLOCK: [2025-11-27 Thu 00:35]--[2025-11-27 Thu 00:42] =>  0:07
CLOCK: [2025-11-26 Wed 19:31]--[2025-11-26 Wed 19:34] =>  0:03
:END:
#+begin_src elisp :tangle yes
  (generate-ert-deftest-n-times org-table-autofill-string-left ()
    (-let* ((test-row-count (generate-random-nat-number-in-range (list 2 10)))
  	  (test-row-number (generate-random-nat-number-in-range (list 1 test-row-count)))
  	  (test-end-column-number (generate-random-nat-number-in-range (list 1 10)))
  	  (test-beg-column-number (generate-random-nat-number-in-range (list (1+ test-end-column-number) (+ 10 test-end-column-number))))
  	  (test-column-count (generate-random-nat-number-in-range (list (1+ test-beg-column-number) (+ 10 test-beg-column-number))))
  	  (test-cell-value (generate-random-word)))
      (should
       (equal (generate-with-buffer-with-org-table-with-hlines (list (cl-constantly "1") test-row-count test-column-count)  				     
  				   (org-table-goto-line-column test-row-number test-beg-column-number)
  				   (org-table-get-field nil test-cell-value)
  				   (org-table-align)
  				   (setq test-beg (point))
  				   (org-table-goto-column test-end-column-number)
  				   (setq test-end (point))
  				   (org-table-autofill test-beg test-end)
  				   (org-table-align)
  				   (org-no-properties-and-trim (org-table-get-field (generate-random-nat-number-in-range (list test-end-column-number (1- test-beg-column-number))))))
  	    test-cell-value)))) 
#+end_src
*** Down + Right
:PROPERTIES:
:ID:       f0781b9f-0007-4f93-a9ba-acb7d402ea80
:END:
:LOGBOOK:
CLOCK: [2025-11-28 Fri 00:43]--[2025-11-28 Fri 00:47] =>  0:04
CLOCK: [2025-11-27 Thu 03:09]--[2025-11-27 Thu 03:20] =>  0:11
CLOCK: [2025-11-26 Wed 21:43]--[2025-11-26 Wed 21:51] =>  0:08
:END:
#+begin_src elisp :tangle yes
  (generate-ert-deftest-n-times org-table-autofill-string-down-right ()
    (-let* ((test-beg-column-number (generate-random-nat-number-in-range (list 1 10)))
  	  (test-end-column-number (generate-random-nat-number-in-range (list (1+ test-beg-column-number) (+ 10 test-beg-column-number))))
  	  (test-column-count (generate-random-nat-number-in-range (list (1+ test-end-column-number) (+ 10 test-end-column-number))))  	  
  	  (test-beg-row-number (generate-random-nat-number-in-range (list 1 10)))
  	  (test-end-row-number (generate-random-nat-number-in-range (list (1+ test-beg-row-number) (+ 10 test-beg-row-number))))
  	  (test-row-count (generate-random-nat-number-in-range (list (1+ test-end-row-number) (+ 10 test-end-row-number))))
  	  (test-cell-value (generate-random-word)))
      (should
       (equal (generate-with-buffer-with-org-table-with-hlines (list (cl-constantly "1") test-row-count test-column-count)  				     
  				   (org-table-goto-line-column test-beg-row-number test-beg-column-number)
  				   (org-table-get-field nil test-cell-value)
  				   (setq test-beg (point))
  				   (org-table-goto-line-column test-end-row-number test-end-column-number)
  				   (setq test-end (point))
  				   (org-table-autofill test-beg test-end)
  				   (org-table-align)
  				   (org-no-properties-and-trim (org-table-get (generate-random-nat-number-in-range (list (1+ test-beg-row-number) test-end-row-number))
  							       (generate-random-nat-number-in-range (list (1+ test-beg-column-number) test-end-column-number)))))
  	    test-cell-value)))) 
#+end_src
*** Up + Left
:LOGBOOK:
CLOCK: [2025-11-28 Fri 16:15]--[2025-11-28 Fri 16:28] =>  0:13
:END:
#+begin_src elisp :tangle yes
  (generate-ert-deftest-n-times org-table-autofill-string-up-left ()
    (-let* ((test-end-row-number (generate-random-nat-number-in-range (list 1 10)))
  	  (test-beg-row-number (generate-random-nat-number-in-range (list (1+ test-end-row-number) (+ 10 test-end-row-number))))
  	  (test-row-count (generate-random-nat-number-in-range (list (1+ test-beg-row-number) (+ 10 test-beg-row-number))))  	  
  	  (test-end-column-number (generate-random-nat-number-in-range (list 1 10)))
  	  (test-beg-column-number (generate-random-nat-number-in-range (list (1+ test-end-column-number) (+ 10 test-end-column-number))))
  	  (test-column-count (generate-random-nat-number-in-range (list (1+ test-beg-column-number) (+ 10 test-beg-column-number))))
  	  (test-cell-value (generate-random-word)))
      (should
       (equal (generate-with-buffer-with-org-table-with-hlines (list (cl-constantly "1") test-row-count test-column-count)  				     
  				   (org-table-goto-line-column test-beg-row-number test-beg-column-number)
  				   (org-table-get-field nil test-cell-value)
  				   (org-table-align)
  				   (setq test-beg (point))
  				   (org-table-goto-line-column test-end-row-number test-end-column-number)
  				   (setq test-end (point))
  				   (org-table-autofill test-beg test-end)
  				   (org-table-align)
  				   (org-no-properties-and-trim (org-table-get (generate-random-nat-number-in-range (list test-end-row-number (1- test-beg-row-number)))
  							       (generate-random-nat-number-in-range (list test-end-column-number (1- test-beg-column-number))))))
  	    test-cell-value)))) 
#+end_src

* org-table-map-cells
:LOGBOOK:
CLOCK: [2026-01-08 Thu 09:24]--[2026-01-08 Thu 09:42] =>  0:18
:END:
** org-table--count-rows
** org-table--count-cols 
** function
#+begin_src elisp :tangle yes
  (defalias 'org-table--flipped-elt (-flip elt))
  (generate-ert-deftest-n-times org-table-map-cells ()
    (-let* (((test-row-col &as test-row-count test-column-count) (generate--times-no-args 2 (generate-random-nat-number-in-range (list 1 10))))
  	  ((test-row-number test-column-number) (mapcar #'generate--random-nat-number-between-0-and test-row-col))
  	  (test-cell-value (generate-random-word))
  	  (actual-cells '()))
      (generate-with-buffer-with-org-table-with-hlines (list (cl-constantly test-cell-value) test-row-count test-column-count)
        (org-table-map-cells (lambda (cell-value cell-row cell-col) (push (list cell-value cell-row cell-col) actual-cells))))
      (should (thread-last actual-cells (-group-by #'-second-item) (org-table--flipped-elt test-row-number) (org-table--flipped-elt test-col-number)))))
  
#+end_src

* org-table-align
** Constants
 #+begin_src elisp :tangle yes
   (defconst SINGLE-ROW-ALIGN-TESTS
     (list (cons "| a |\n" "|   a |")
	 (cons "|----|" "|----|")
	 (cons "|---|---|---|" "|---|---|---|")
	 (cons "  | a |\n" "  |   a |")
	 (cons "  | a | b |\n" "  |   a | b |")
	 (cons "| a        | b |" "| a | b |")))

   (defconst BASIC-ALIGN-TESTS
     (list (cons "| a |\n" "|   a |")
	 (cons "  | a |\n" "  |   a |")
	 (cons "| 123 |\n|-----|\n" "| 123 |\n|-|")
	 (cons "| a | b |\n|---+---|\n" "| a | b |\n|-+-|")
	 (cons "| a   | bc |\n| bcd |    |\n" "| a | bc |\n| bcd |  |")
	 (cons "| abc | bc  |\n|     | bcd |\n" "| abc | bc |\n| | bcd |")
	 (cons "| a | b |\n| c |   |\n" "| a | b |\n| c |")
	 (cons "| a | b |\n|---+---|\n" "| a | b |\n|---|")))

   (defconst ALIGNMENT-COOKIE-TEST
     (list (cons "|   1 |\n|  12 |\n| abc |" "| 1 |\n| 12 |\n| abc |")
	 (cons "| 1   |\n| ab  |\n| abc |" "| 1 |\n| ab |\n| abc |")
	 (cons "| <r> |\n|  ab |\n| abc |" "| <r> |\n| ab |\n| abc |")
	 (cons "| <l> |\n| 12  |\n| 123 |" "| <l> |\n| 12 |\n| 123 |")
	 (cons "| <c> |\n|  1  |\n| 123 |" "| <c> |\n| 1 |\n| 123 |")))

 #+end_src
